{
    "context_instructions": "",
    "directives": {
        "question_analysis": "You are an assistant professor in Mathematics at a top university. You will be given a question and a first-year student's solution to it. Your task is to:\n\n1. Evaluate the rigor of the student's solution.\n\n2. Identify any invalid assumptions (which don't form the basis for a proof by contradiction)\n\n 3. Identify any incorrect reasoning.\n\nBe precise and specific.\n\nThe question:\n\n\"\"\"\n{prompt}\n\"\"\"\n\nThe student's solution:\n\n\"\"\"\n{output}\n\"\"\"",
        "feedback": "You are an assistant professor of Mathematics at a top university. You will be given a question, a first-year mathematics student's solution, and an analysis of the solution written by a teaching assistant. Your task is to:\n\n1. Evaluate the student's solution using the provided analysis.\n2. Provide feedback that is clear, precise and specific. Be concrete; highlight mistakes, areas for improvement in rigor, clarity, and mathematical thinking.\n\nThe question is:\n\"\"\"\n{prompt}\n\"\"\"\n\nThe student's solution is:\n\"\"\"\n{output}\n\"\"\"\n\nThe analysis of the solution is:\n\"\"\"\n{question_analysis}\n\"\"\"\n\nYour feedback should capture the most significant ways the student can improve. It must be focused, actionable, and not longer than 200 words.\n\n3. Convert the grade to a correct/incorrect decision based on the provided feedback.",
        "regraded": "You are an advanced mathematics teaching assistant. Your task is to assign a grade to a student's work based solely on the question, the provided feedback, and the provided marking criteria. The grade is a number between 0 and 5, do not output anything else. \n You will now be given the question, the marking criteria and the feedback.\n\n The Question: {prompt} \n\n  The Marking Criteria written in LaTeX:\n\n While clarity and conciseness are important, correctness and mathematical rigour are the primary factors in determining a mark. Please note that marks at the extremes of the scale should be awarded where appropriate.\n\n\\paragraph{0/5 marks}: No relevant steps taken (ideas would not appear in an ideal proof); lack of understanding (e.g. alluding to unrelated results).\n\\paragraph{1/5 marks}: Some correct ideas or elements present (e.g. beginning of a proof, use of relevant definitions/theorems); mathematical argument is not valid (e.g. incorrect assumptions, misapplications of theorems)\n\\paragraph{2/5 marks}: Correct approach but would require substantial improvement (e.g. attempt at a proof); major errors present (e.g. non-trivial properties used without proof)\n\\paragraph{3/5 marks}: Correct approach with significant errors or gaps (e.g. imprecise arguments, insufficient justification)\n\\paragraph{4/5 marks}: Correct solution with minor mistakes (e.g. small logical steps omitted, arithmetic errors that do not qualitatively affect the answer)\n\\paragraph{5/5 marks}: Correct and complete solution (e.g. rigorous and well structured); minimal superfluous steps (allow some leeway, e.g. using trivial results without thorough justification).\n\n Output a single integer. \n\n Feedback:\n\n {feedback}",
        "correctness": "Convert the following grade to a correct/incorrect decision:{regraded}\n\nOnly a grade of 5 is correct.\n\nAnswer only with 'correct' or 'incorrect'."
    },
    "parameters": {
    },
    "variables": {}
}