{
    "context_instructions": "",
    "directives": {
        "markscheme": "You are an advanced mathematics teaching assistant. Your task is to create a marking criteria, ranging from grades 0 to 5, for an undergraduate maths assignment question. A 5/5 answer should be mathematically rigorous and based solely on the assumptions given in the question, while a 0/5 answer should contain no correct logical steps towards solving the question. Use your own intuition for the marks inbetween.\n You will now be given the question. \n The Question: \n\n {prompt}",
        "feedback": "You are an advanced mathematics teaching assistant. Your task is to analyse an undergraduate math student's solution and use the given marking criteria to provide concise but helpful feedback on how the student can improve. You should only output feedback reflecting on the merit of the students work, withold the grade to avoid misinterpretation.\n You will now be given the question, the student's solution and the marking criteria.\n  The Question: \n\n {prompt} \n\n The student's solution: \n\n {output} \n\n The marking criteria: \n\n {markscheme}.",
        "grade_feedback":"You are an advanced mathematics teaching assistant. Your task is to assign a grade to a student's work based solely on the question, the provided feedback, and the provided marking criteria. The grade is a number between 0 and 5, do not output anything else. \n You will now be given thequestion, the marking criteria and the feedback.\n\n The Question: {prompt} \n\n  The Marking Criteria written in Markdown:\n\n While clarity and conciseness are important, correctness and mathematical rigour are the primary factors in determining a mark. Please note that marks at the extremes of the scale should be awarded where appropriate.\n\n**0/5 marks**: No relevant steps taken (ideas would not appear in an ideal proof); lack of understanding (e.g. alluding to unrelated results).\n\n**1/5 marks**: Some correct ideas or elements present (e.g. beginning of a proof, use of relevant definitions/theorems); mathematical argument is not valid (e.g. incorrect assumptions, misapplications of theorems)\n\n**2/5 marks**: Correct approach but would require substantial improvement (e.g. attempt at a proof); major errors present (e.g. non-trivial properties used without proof)\n\n**3/5 marks**: Correct approach with significant errors or gaps (e.g. imprecise arguments, insufficient justification)\n\n**4/5 marks**: Correct solution with minor mistakes (e.g. small logical steps omitted, arithmetic errors that do not qualitatively affect the answer)\n\n**5/5 marks**: Correct and complete solution (e.g. rigorous and well structured); minimal superfluous steps (allow some leeway, e.g. using trivial results without thorough justification).\n\n The Feedback:\n\n {feedback}.",
        "correctness": "Convert the grade given into a correct/incorrect decision. If the grade is not 4 or 5, return 'incorrect', otherwise return 'correct'. Don't output anything else, just that word. Here is the grade: {grade_feedback}"
    },
    "parameters": {
    },
    "variables": {}
}